Autodesk.Revit.DB.FabricationDimensionType
Fabrication dimension type.
Since:
2016
Since:
2016

Autodesk.Revit.DB.FabricationDimensionType.Length
Length.

Autodesk.Revit.DB.FabricationDimensionType.Angle
Angle.

Autodesk.Revit.DB.FabricationDimensionType.Diameter
Diameter.

Autodesk.Revit.DB.FabricationDimensionType.Depth
Depth.

Autodesk.Revit.DB.FabricationDimensionType.Width
Width.

Autodesk.Revit.DB.FabricationDimensionType.Internal
Internal.